Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
  /* Barrier to ensure programming is performed in 2 steps, in right order
    (independently of compiler optimization behavior) */
  __ISB();

  /* Program second word */
  *(uint32_t *)(Address + 4U) = (uint32_t)(Data >> 32U);
}


/**
  * @brief  Program double word or fast program of a row at a specified address.
  * @param  TypeProgram Indicate the way to program at a specified address.
  *                      This parameter can be a value of @ref FLASH_Type_Program
  * @param  Address Specifies the address to be programmed.
  * @param  Data Specifies the data to be programmed
  *               This parameter is the data for the double word program and the address where
  *               are stored the data for the row fast program depending on the TypeProgram:
  *               TypeProgram = FLASH_TYPEPROGRAM_DOUBLEWORD (64-bit)
  *               TypeProgram = FLASH_TYPEPROGRAM_FAST (32-bit).
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_Program_Double(uint32_t Address, uint64_t Data)
{
  HAL_StatusTypeDef status;

 
  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation_(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    /* Program double-word (64-bit) at a specified address */
    FLASH_Program_DoubleWord_(Address, Data);

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation_(FLASH_TIMEOUT_VALUE);

    /* If the program operation is completed, disable the PG */
    CLEAR_BIT(FLASH->CR, FLASH_CR_PG);
  }

  /* Process Unlocked */
  //__HAL_UNLOCK(&pFlash);

  /* return status */
  return status;
}

/**                                                              
  * @brief  Program 64bit data into flash: this function writes an 8byte (64bit)
  *         data chunk into the flash and increments the data pointer.
  * @see    README for futher information
  * @param  data: 64bit data chunk to be written into flash
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: upon success
  * @retval BL_WRITE_ERROR: upon failure
*/
uint8_t Bootloader_FlashNext(uint64_t data)
{
  uint64_t read_data;
  HAL_StatusTypeDef status = HAL_OK; //debug
  if(!(flash_ptr <= (FLASH_BASE + FLASH_SIZE - 8)) ||
  (flash_ptr < APP_ADDRESS))
  {
    HAL_FLASH_Lock();
    return BL_WRITE_ERROR;
  }
  
  status = HAL_FLASH_Program_Double(flash_ptr, data);
  if(status == HAL_OK)
  {
    /* Check the written value */
    read_data = *(uint64_t*)flash_ptr; 
    if(read_data != data)
    {
      /* Flash content doesn't match source content */
      HAL_FLASH_Lock();
      kprint("Programming error\n");
      //sprintf(msg, "  expected data (64 bit): %08lX %08lX\n", (uint32_t) (data >> 32) ,(uint32_t) data);
      //kprint(msg);
      //sprintf(msg, "  actual data (64 bit)  : %08lX %08lX\n", (uint32_t) (read_data >> 32) ,(uint32_t) read_data);
      //kprint(msg);
      //sprintf(msg, "  absolute address (byte): %08lX\n", flash_ptr);
      //kprint(msg);
      
      
      
      return BL_WRITE_ERROR;
    }
    /* Increment Flash destination address */
    flash_ptr += 8;
    //        flash_ptr += 4;
  }
  else
  {
    /* Error occurred while writing data into Flash */ 
    HAL_FLASH_Lock();
    kprint("Programming error\n");
    //sprintf(msg, "programming error - status: %04X\n", status);
    //kprint(msg);
    //
    //sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
    //kprint(msg);
    //
    //sprintf(msg, "sector: %08lX\n", ((flash_ptr - 0x08000000)/FLASH_SECTOR_SIZE));
    //kprint(msg);
    
    return BL_WRITE_ERROR;
  }
  
  return BL_OK;
}

/**
  * @brief  Finish flash programming: this function finalizes the flash
  *         programming by locking the flash.
  * @see    README for futher information
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK is returned in every case
*/
uint8_t Bootloader_FlashEnd(void)
{
  /* Lock flash */
  HAL_FLASH_Lock();
  FLASH->SR  |= (FLASH_SR_EOP | FLASH_SR_WRPERR | FLASH_SR_PROGERR);
  
  return BL_OK;
}

/**
  * @brief  This function returns the protection status of the application area flash.
  * @return true if application area is protected
*/
uint8_t Bootloader_GetProtectionStatus(void)
{
  #define WITHIN(N,L,H)       ((N) >= (L) && (N) <= (H))
  
  if (app_size) {
    uint8_t first_app_page = (APP_ADDRESS - FLASH_BASE)/FLASH_SECTOR_SIZE;
    uint8_t last_app_page = ((app_size/FLASH_SECTOR_SIZE) + first_app_page);
    if (app_size % FLASH_SECTOR_SIZE) last_app_page++;  // include partial page
    
    //sprintf(msg, "first_app_page : %2X   last_app_page: %2X\n", first_app_page, last_app_page);
    //kprint(msg);

    if (wrp1a_end >= wrp1a_strt) {
      // CASE A - wrp1a starts in app area
      if (WITHIN(wrp1a_strt, first_app_page, last_app_page)) {
        return 1;
      }
      // CASE B - wrp1a ends in application area
      if (WITHIN(wrp1a_end, first_app_page, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp1a
      if (WITHIN(last_app_page, wrp1a_strt, wrp1a_end)) {
        return 1;
      }
    }  // end wrp1a
    
    
    if (wrp1b_end >= wrp1b_strt) {
      // CASE A - wrp1b starts in app area
      if (WITHIN(wrp1b_strt, first_app_page, last_app_page)) {
        return 1;
      }
      // CASE B - wrp1b ends in application area
      if (WITHIN(wrp1b_end, first_app_page, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp1b
      if (WITHIN(last_app_page, wrp1b_strt, wrp1b_end)) {
        return 1;
      }
    }  // end wrp1b

  }  // app size
  return 0;
}

// debug helper routine
const char *byte_to_binary (uint32_t x)
{
  static char b[33];
  b[0] = '\0';
  
  uint32_t z;
  for (z = 1 << 31; z > 0; z >>= 1)
  {
    strcat(b, ((x & z) == z) ? "1" : "0");
  }
  
  return b;
}


/**
  * @brief  This function configures the write protection of flash.
  * @param  protection: protection type ::eFlashProtectionTypes
  * @retval BL_OK: 
  
  *
  * Setting the protection is a five step process
  *   1) Determine final proection
  *   2) Disable protection on desired sectors
  *   3) Enable protection on all other sectors
  *   4) Invoke HAL_FLASH_OB_Launch()
  *   5) Send the system through reset so that the new settings take effect
  * 
*/

uint8_t Bootloader_ConfigProtection_Set(uint32_t *data) {  
  /*          
  * Programs write protection bits per the data in the input array
  * 
  * System goes through reset in order to make the new bits active.
  *
  * * @retval None
  */

  
